# NewBoundingBoxXYZ Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewBoundingBoxXYZ Method
Application Class See Also
---
Creates a three-dimensional rectangular box.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public BoundingBoxXYZ NewBoundingBoxXYZ()
```

Visual Basic
---
```text
Public Function NewBoundingBoxXYZ As BoundingBoxXYZ
```

Visual C++
---
```text
public:
BoundingBoxXYZ^ NewBoundingBoxXYZ()
```

# See Also
Application Class
Autodesk.Revit.Creation Namespace